// Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.
// 14212 -> нет
// 12821 -> да
// 23432 -> да

Console.WriteLine("Enter a 5-digit number to define a palindrome: ");
int n = Convert.ToInt32(Console.ReadLine());
// int i = n / 1000;
// int i2 = n / 10000;
// if (i2 == n % 10 && i % 10 == (n / 10) % 10)
// {
//     Console.WriteLine("Yes");
// }
// else
// {
//     Console.WriteLine("No");
// }
