// Напишите программу, которая будет преобразовывать десятичное число в двоичное.
// 45 -> 101101
// 3 -> 11
// 2 -> 10

Console.WriteLine("Enter a number: ");
int n = Convert.ToInt32(Console.ReadLine());

int y = 0;

for (int i = 0; i < n; i++)
{
    
}