// Напишите программу, которая на вход принимает число и выдает, является ли число четным (делится ли оно на два без остатка).
// 4 -> да
// -3 -> нет
// 7 -> нет

Console.WriteLine("Enter a number: ");
int number = Convert.ToInt32(Console.ReadLine());

if (number = number / 2)
{
    Console.WriteLine("yes");
}