// Напишите программу, которая будет принимать на вход число и возвращать сумму его цифр.
// 453 -> 12
// 45 -> 9

Console.WriteLine("Enter a number: ");
int n = Convert.ToInt32(Console.ReadLine());

